// тип данных
// String - тип данных для текста
// Number - тип данных для чисел
// Boolean - тип данных для логических значений (true/false)
// null - спецалльное значение которые озночает отстутствие значения
// undefined - специальное значениеб которое означает что переманная не была инициализирована
// Object - тип данных для обьетков которые могут содержать свойства и методы 
// BigInt - тип данных для больших чисел
// Symbol  - тип данных для уникальных идентифакторов


// let vfdf = "hello world";
// console.log(typeof vfdf);

// let a = 42;
// console.log(typeof a)

// let b = "123456789";
// console.log(typeof b)

// условия операторы
// if (условие) {
//     код который выполнится если условие истинно
// } else {
//     код который выполнится если условие сложно
// }

// if(5 < 3) {
//     console.log("5 больше 3");

// }else {
//     console.log("5 меньше 3");
// }

//  let age = 18
// if(age >=18) {
//    console.log ("Вы совершеннолетний");
// }else {
//    console ("вы несовершеннолетний");
// }
   

// let name = prompt("ведите счет");
// if( age % 2 == 0){
//     alert( "счет");
//     console.log("счет");
// }else{
//     alert
// }




let age = prompt("ведиту ваш возрвст");
if(age <= 15){
    alert("салам балакай")
}else if (age > 15 && age <=30){
    alert ("салам жигит")
}
if(age > 30 && age <=50){
    alert ("салам байке")
}
else if(age > 50 && age <=70)
    alert("салам  ата")
if (age > 70 && age <=100)
    alert("салам чон ата")
else if(age > 100 && age <=1)
    alert("салам чоон ата")



