// методы массивов
// что такое массив?
// lenght -  массивдин ичиндеги элементтердин саны
// push - массивдин аягына элемент кошот
//pop - массивдин аягынан элементти алып салат
//

let arr = [1, 2, 3, 4, 5];

arr.push(10);
arr.pop();

arr.unshift(0); // массивдин башына элемент кошот
arr.shift(); // массивдин башынан элементти алып салат

arr.splice(1, 2); // массивдин ичиндеги элементтерди алып салат

arr.splice(1, 0, 5, 6); // массивдин ичиндеги элементтерди кошот

arr.reverse(); // массивдин ичиндеги элементтерди тескери кылат

console.log(arr);
console.log(arr.length);
console.log(arr.reduce((acc, curr) => acc + curr, 0)); // массивдин ичиндеги элементтердин суммасын чыгарат

const doubleArr = arr.map((num) => num * 2); // массивдин ичиндеги элементтерди көбөйтөт
console.log(doubleArr);

const evens = arr.filter((num) => num % 2 === 0); // массивдин ичиндеги жуп элементтерди чыгарат
console.log(evens);

console.log(arr[0]); // массивдин биринчи элементин чыгарат


